# 28-02-2024

# READING CSV FILE

- The 4 most packages we use in EDA are
  - pandas
  - numpy
  - matplotlib
  - seaborn

In [4]:
import numpy as np#(fo math operations)
import pandas as pd     # (for dataframes)
import matplotlib.pyplot as plt #(for diagrams and ploting)
import seaborn as sns  #(for diagrams and ploating)

In [2]:
#for reading csv file by pandas
#we required filelocation,filename,file extentaion
#example visa dataset

In [3]:
r"C:\Users\kragh\Data Files\Visadataset - Visadataset.csv"

'C:\\Users\\kragh\\Data Files\\Visadataset - Visadataset.csv'

In [1]:
path='C:\\Users\\kragh\\Data Files\\Visadataset - Visadataset.csv'

In [2]:
# now opening dataset by pandas(pd)
# here we dont need to open in as in normal filehandling 
# here we have direct method

In [5]:
pd.read_csv('Visadataset - Visadataset.csv')
#done

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,Certified
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,Certified
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.8500,Year,N,Certified
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,Certified
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,Certified

In [ ]:
#if our data is not displayed in proper then use sep=";"

In [ ]:
pd.read_csv(path,sep=";")

# CREATING DATAFRAMES BY USING LIST

In [8]:
#example
names=['Raghu','Pavan','Charan']
ages=[20,21,25]
names,ages

(['Raghu', 'Pavan', 'Charan'], [20, 21, 25])

**Step-1**
- Creating DataFrame

In [9]:
#method to create the dataframe
pd.DataFrame()

Empty DataFrame
Columns: []
Index: []

**Step-2**
- zip the Data

In [10]:
pd.DataFrame(zip(names,ages))

        0   1
0   Raghu  20
1   Pavan  21
2  Charan  25

In [11]:
#also we can provise like this
data=zip(names,ages)
pd.DataFrame(data)

        0   1
0   Raghu  20
1   Pavan  21
2  Charan  25

**Step-3**
- Proving Coloumns

In [12]:
pd.DataFrame(zip(names,ages),columns=['NAMES','AGES'])

    NAMES  AGES
0   Raghu    20
1   Pavan    21
2  Charan    25

In [13]:
#also 
data=zip(names,ages)
colms=['Names','Age']
pd.DataFrame(data,columns=colms)

    Names  Age
0   Raghu   20
1   Pavan   21
2  Charan   25

**Step-4**
- Providing index(rownames)

In [14]:
pd.DataFrame(zip(names,ages),columns=['NAMES','AGE'],index=['a','b','c'])

    NAMES  AGE
a   Raghu   20
b   Pavan   21
c  Charan   25

In [15]:
#we can also provide in this way

In [16]:
data=zip(names,ages)
colms=['Names','Age']
rows=['A','B','C']
pd.DataFrame(data,columns=colms,index=rows)

    Names  Age
A   Raghu   20
B   Pavan   21
C  Charan   25

**Step-5**
- Providing NEW coloum

In [17]:
#to provide a new coloumn give a varable at existing path of dataframes
#example [df=pd.DataFrame(data,columns=colms,index=rows)]
data=zip(names,ages)
colms=['Names','Age']
rows=['A','B','C']
df=pd.DataFrame(data,columns=colms,index=rows)
df

    Names  Age
A   Raghu   20
B   Pavan   21
C  Charan   25

- If u want to add new coloum
- df['new_col_name']
- if we are have a list of elements 
- which are equtal to number of rows as rollnumbers=[39,45,34]
- pd['new_col_name']=rollnumbers

In [18]:
rollnumbers=[39,45,33]
df['RollNo']=rollnumbers
df

    Names  Age  RollNo
A   Raghu   20      39
B   Pavan   21      45
C  Charan   25      33

**Step-6**
- Updating the Coloumn
- both Updaing and adding Colums are same manner

In [19]:
df['Names']=['Thala','Virat','Raina']

In [20]:
df

   Names  Age  RollNo
A  Thala   20      39
B  Virat   21      45
C  Raina   25      33

**Step-7**
- Droping the coloums
- here we have drop method 
- it takes 3 basic 1)colum(or)row name,if colm name is given then
- 2) axis=1 (or) 0 for colum give 1 or row give 0
- 3) inplace=True if we want to override existing dataframe

In [21]:
data=zip(names,ages)
colms=['Names','Age']
rows=['A','B','C']
df=pd.DataFrame(data,columns=colms,index=rows)
df
rollnumbers=[39,45,34]
df['RollNo']=rollnumbers
print(df)


#now drop the column

df=df.drop('Age'#column name
        ,axis=1)#column
print(df)

    Names  Age  RollNo
A   Raghu   20      39
B   Pavan   21      45
C  Charan   25      34
    Names  RollNo
A   Raghu      39
B   Pavan      45
C  Charan      34

**Step-8** 
- Droping Rows

In [22]:
df=df.drop('B',
       axis=0)
print(df)

    Names  RollNo
A   Raghu      39
C  Charan      34

**Step-9**
- Saving the dataframe

In [23]:
df.to_csv("demo111.csv")#here we can give any name with extentation(example) demo.csv

In [24]:
#now go and check thus where our python file existed

**Step-10**
- Read the DataFrame we saved

In [33]:
pd.read_csv('demo111.csv')
# here the draw back is when we are saving then our index aslo consider as one column
# so to aviod this while saving
#give index=False

  Unnamed: 0   Names  RollNo
0          A   Raghu      39
1          C  Charan      34

In [26]:
df.to_csv('demo.csv',index=False)

In [27]:
#now read it

In [28]:
pd.read_csv('demo.csv')

    Names  RollNo
0   Raghu      39
1  Charan      34

# CREATING DATAFRAME BY USING DIST

In [29]:
dist1={'NAMES':['RAGHU','PAVAN','THALA'],'AGE':[30,40,50],'ROLLNO':[10,20,30]}

In [30]:
pd.DataFrame(dist1,index=['row1','row2','row3'])
#here we no need zip ,colnames it take default

      NAMES  AGE  ROLLNO
row1  RAGHU   30      10
row2  PAVAN   40      20
row3  THALA   50      30

In [32]:
#=======================================================================================================================